# -*- coding: utf-8 -*-

# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

# В этом модуле создать рецепт двойного чизбургера (https://goo.gl/zA3goZ)
# с помощью фукций из my_burger и вывести на консоль.

# Создать рецепт своего бургера, по вашему вкусу.
# Если не хватает инградиентов - создать соответствующие функции в модуле my_burger

# TODO здесь ваш код

def bun():
    print('Берем булочку')


def cutlet():
    print('Ложим обжаренную котлету')


def cucumber():
    print('А теперь добавим огурец')


def tomato():
    print('А теперь добавим помидор')


def mayonnaise():
    print('Намазываем майонез')

def cheese():
    print('Добавляем сыр Чеддер')


# Для своего бургера
def salad():
    print('Добавляем салат')


