#!/usr/bin/env python
# -*- coding: utf-8 -*-
from pprint import pprint
# Есть словарь магазинов с распродажами

shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
sweets = {
    'печенье':
        [
            {'shop': 'ашан', 'price': 10.99},
            {'shop': 'пяторочка', 'price': 9.99},
            {'shop': 'магнит', 'price': 11.99},
        # TODO тут с клавиатуры введите магазины и цены (можно копипастить ;)
        ],
    'конфеты':
        [
            {'shop': 'ашан', 'price': 34.99},
            {'shop': 'пяторочка', 'price': 32.99},
            {'shop': 'магнит', 'price': 30.99},
        ],
    'карамель':
        [
            {'shop': 'ашан', 'price': 45.99},
            {'shop': 'пяторочка', 'price': 46.99},
            {'shop': 'магнит', 'price': 41.99},
        ],
    'пирожное':
        [
            {'shop': 'ашан', 'price': 67.99},
            {'shop': 'пяторочка', 'price': 59.99},
            {'shop': 'магнит', 'price': 62.99},
        ]


    # TODO тут с клавиатуры введите другую сладость и далее словарь магазинов
}
pprint(sweets)
# Указать надо только по 2 магазина с минимальными ценами
sweets = {
    'печенье':
        [
            {'shop': 'ашан', 'price': 10.99},
            {'shop': 'пяторочка', 'price': 9.99},

        # TODO тут с клавиатуры введите магазины и цены (можно копипастить ;)
        ],
    'конфеты':
        [

            {'shop': 'пяторочка', 'price': 32.99},
            {'shop': 'магнит', 'price': 30.99},
        ],
    'карамель':
        [
            {'shop': 'ашан', 'price': 45.99},

            {'shop': 'магнит', 'price': 41.99},
        ],
    'пирожное':
        [

            {'shop': 'пяторочка', 'price': 59.99},
            {'shop': 'магнит', 'price': 62.99},
        ]


    # TODO тут с клавиатуры введите другую сладость и далее словарь магазинов
}
pprint(sweets)

print(sweets['печенье'][0]['price'])